lang/java-lib-springboot.org
#+TITLE: SpringBoot
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2019-07-10 Wed>
#+TAGS: springboot web framework springBoot


* SpringBoot
  [[https://spring.io/projects/spring-boot/#overview][SpringBoot]] 是由 Pivotal 团队提供的全新框架，其设计目的是用来简化新 Spring 应用
  的初始搭建以及开发过程。该框架使用了特定的方式来进行配置，从而使开发人员不再需
  要定义样板化的配置。通过这种方式，Spring Boot 致力于在蓬勃发展的快速应用开发领
  域(rapid application development) 成为领导者。SpringBoot 的文档见[[https://docs.spring.io/spring-boot/docs/current/reference/html/][html]] ，源代码
  托管于 [[https://github.com/spring-projects/spring-boot][GitHub]] 。

* 命令行工具
   SpringBoot 命令行工具参考 [[file:../tool/springboot-cli.org][cli]]

* 编译系统
** 继承父 starter
   SpringBoot 项目需要继承的父级 Starter，配置如下：
   #+BEGIN_SRC xml
     <!-- Inherit defaults from Spring Boot -->
     <parent>
      <groupId>org.springframework.boot</groupId>
      <artifactId>spring-boot-starter-parent</artifactId>
      <version>2.1.0.RELEASE</version>
     </parent>
   #+END_SRC
