lang/java-lib-springboot.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-10 Wed 11:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SpringBoot</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">SpringBoot</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2112ba1">1. SpringBoot</a></li>
<li><a href="#org39f731f">2. 命令行工具</a></li>
<li><a href="#orgebd2751">3. 编译系统</a>
<ul>
<li><a href="#org26d8b8d">3.1. 继承父 starter</a></li>
<li><a href="#orgef79e8e">3.2. Starters</a></li>
</ul>
</li>
<li><a href="#orgde39c02">4. Spring Beans 和依赖注入</a></li>
<li><a href="#orga41967e">5. <code>@SpringBootApplication</code> 标注</a></li>
<li><a href="#orgac831a0">6. 外部配置</a>
<ul>
<li><a href="#org73376e3">6.1. <code>@Value</code> 方式配置</a></li>
<li><a href="#orga42032f">6.2. <code>@ConfigurationProperties</code> 方式配置</a></li>
</ul>
</li>
<li><a href="#orge97b3b0">7. 日志</a>
<ul>
<li><a href="#orge107388">7.1. 日志样式</a></li>
<li><a href="#orgdb5fb04">7.2. 控制台输出</a></li>
<li><a href="#orgf2e551d">7.3. 文件输出</a></li>
<li><a href="#org262b128">7.4. 日志级别</a></li>
<li><a href="#orgebb75c9">7.5. 日志分组</a></li>
</ul>
</li>
<li><a href="#orgbdf15c9">8. 配置数据库</a>
<ul>
<li><a href="#org67c256e">8.1. MySQL</a></li>
<li><a href="#org4923f28">8.2. PostgreSQL</a></li>
<li><a href="#org509a6a8">8.3. Oracle</a></li>
</ul>
</li>
<li><a href="#org5d87259">9. 开发工具</a></li>
</ul>
</div>
</div>


<div id="outline-container-org2112ba1" class="outline-2">
<h2 id="org2112ba1"><span class="section-number-2">1</span> SpringBoot</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://spring.io/projects/spring-boot/#overview">SpringBoot</a> 是由 Pivotal 团队提供的全新框架，其设计目的是用来简化新 Spring 应用
的初始搭建以及开发过程。该框架使用了特定的方式来进行配置，从而使开发人员不再需
要定义样板化的配置。通过这种方式，Spring Boot 致力于在蓬勃发展的快速应用开发领
域(rapid application development) 成为领导者。SpringBoot 的文档见<a href="https://docs.spring.io/spring-boot/docs/current/reference/html/">html</a> ，源代码
托管于 <a href="https://github.com/spring-projects/spring-boot">GitHub</a> 。
</p>
</div>
</div>

<div id="outline-container-org39f731f" class="outline-2">
<h2 id="org39f731f"><span class="section-number-2">2</span> 命令行工具</h2>
<div class="outline-text-2" id="text-2">
<p>
SpringBoot 命令行工具参考 <a href="../tool/springboot-cli.html">cli</a>
</p>
</div>
</div>

<div id="outline-container-orgebd2751" class="outline-2">
<h2 id="orgebd2751"><span class="section-number-2">3</span> 编译系统</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org26d8b8d" class="outline-3">
<h3 id="org26d8b8d"><span class="section-number-3">3.1</span> 继承父 starter</h3>
<div class="outline-text-3" id="text-3-1">
<p>
SpringBoot 项目需要继承的父级 Starter，配置如下：
</p>
<div class="org-src-container">
<pre class="src src-xml"><span style="color: #93a1a1; font-style: italic;">&lt;!-- </span><span style="color: #93a1a1; font-style: italic;">Inherit defaults from Spring Boot </span><span style="color: #93a1a1; font-style: italic;">--&gt;</span>
&lt;<span style="color: #b58900;">parent</span>&gt;
 &lt;<span style="color: #b58900;">groupId</span>&gt;org.springframework.boot&lt;/<span style="color: #b58900;">groupId</span>&gt;
 &lt;<span style="color: #b58900;">artifactId</span>&gt;spring-boot-starter-parent&lt;/<span style="color: #b58900;">artifactId</span>&gt;
 &lt;<span style="color: #b58900;">version</span>&gt;2.1.0.RELEASE&lt;/<span style="color: #b58900;">version</span>&gt;
&lt;/<span style="color: #b58900;">parent</span>&gt;
</pre>
</div>
</div>
</div>
