lang/java-lib-springboot.html
<div id="outline-container-orgef79e8e" class="outline-3">
<h3 id="orgef79e8e"><span class="section-number-3">3.2</span> Starters</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Starters 是 SpringBoot 对其依赖的再打包，官方的 Starter 都是以
<code>spring-boot-starter</code> 开头，并且存放在 <a href="https://github.com/spring-projects/spring-boot/tree/master/spring-boot-project/spring-boot-starters">spring-boot-starters</a> 中
</p>
<ul class="org-ul">
<li><code>spring-boot-starter</code> : Core starter, including auto-configuration support,
logging and YAML</li>
<li><code>spring-boot-starter-activemq</code> : Starter for JMS messaging using Apache
ActiveMQ</li>
<li><code>spring-boot-starter-amqp</code> : Starter for using Spring AMQP and Rabbit MQ</li>
<li><code>spring-boot-starter-aop</code> : Starter for aspect-oriented programming with
Spring AOP and AspectJ</li>
<li><code>spring-boot-starter-artemis</code> : Starter for JMS messaging using Apache
Artemis</li>
<li><code>spring-boot-starter-batch</code> : Starter for using Spring Batch</li>
<li><code>spring-boot-starter-cache</code> : Starter for using Spring Framework's caching
support</li>
<li><code>spring-boot-starter-cloud-connectors</code> : Starter for using Spring Cloud
Connectors which simplifies connecting to services in cloud platforms like
Cloud Foundry and Heroku</li>
<li><code>spring-boot-starter-data-cassandra</code> : Starter for using Cassandra
distributed database and Spring Data Cassandra</li>
<li><code>spring-boot-starter-data-cassandra-reactive</code> : Starter for using Cassandra
distributed database and Spring Data Cassandra Reactive</li>
<li><code>spring-boot-starter-data-couchbase</code> : Starter for using Couchbase
document-oriented database and Spring Data Couchbase</li>
<li><code>spring-boot-starter-data-couchbase-reactive</code> : Starter for using Couchbase
document-oriented database and Spring Data Couchbase Reactive</li>
<li><code>spring-boot-starter-data-elasticsearch</code> : Starter for using Elasticsearch
search and analytics engine and Spring Data Elasticsearch</li>
<li><code>spring-boot-starter-data-jdbc</code> : Starter for using Spring Data JDBC</li>
<li><code>spring-boot-starter-data-jpa</code> : Starter for using Spring Data JPA with
Hibernate</li>
<li><code>spring-boot-starter-data-ldap</code> : Starter for using Spring Data LDAP</li>
<li><code>spring-boot-starter-data-mongodb</code> : Starter for using MongoDB
document-oriented database and Spring Data MongoDB</li>
<li><code>spring-boot-starter-data-mongodb-reactive</code> : Starter for using MongoDB
document-oriented database and Spring Data MongoDB Reactive</li>
<li><code>spring-boot-starter-data-neo4j</code> : Starter for using Neo4j graph database
and Spring Data Neo4j</li>
<li><code>spring-boot-starter-data-redis</code> : Starter for using Redis key-value data
store with Spring Data Redis and the Lettuce client</li>
<li><code>spring-boot-starter-data-redis-reactive</code> : Starter for using Redis
key-value data store with Spring Data Redis reactive and the Lettuce client</li>
<li><code>spring-boot-starter-data-rest</code> : Starter for exposing Spring Data
repositories over REST using Spring Data REST</li>
<li><code>spring-boot-starter-data-solr</code> : Starter for using the Apache Solr search
platform with Spring Data Solr</li>
<li><code>spring-boot-starter-freemarker</code> : Starter for building MVC web
applications using FreeMarker views</li>
<li><code>spring-boot-starter-groovy-templates</code> : Starter for building MVC web
applications using Groovy Templates views</li>
<li><code>spring-boot-starter-hateoas</code> : Starter for building hypermedia-based
RESTful web application with Spring MVC and Spring HATEOAS</li>
<li><code>spring-boot-starter-integration</code> : Starter for using Spring Integration</li>
<li><code>spring-boot-starter-jdbc</code> : Starter for using JDBC with the HikariCP
connection pool</li>
<li><code>spring-boot-starter-jersey</code> : Starter for building RESTful web
applications using JAX-RS and Jersey. An alternative to
spring-boot-starter-web</li>
<li><code>spring-boot-starter-jooq</code> : Starter for using jOOQ to access SQL
databases. An alternative to spring-boot-starter-data-jpa or
spring-boot-starter-jdbc</li>
<li><code>spring-boot-starter-json</code> : Starter for reading and writing json</li>
<li><code>spring-boot-starter-jta-atomikos</code> : Starter for JTA transactions using
Atomikos</li>
<li><code>spring-boot-starter-jta-bitronix</code> : Starter for JTA transactions using
Bitronix</li>
<li><code>spring-boot-starter-mail</code> : Starter for using Java Mail and Spring
Framework's email sending support</li>
<li><code>spring-boot-starter-mustache</code> : Starter for building web applications
using Mustache views</li>
<li><code>spring-boot-starter-oauth2-client</code> : Starter for using Spring Security's
OAuth2/OpenID Connect client features</li>
<li><code>spring-boot-starter-oauth2-resource-server</code> : Starter for using Spring
Security's OAuth2 resource server features</li>
<li><code>spring-boot-starter-quartz</code> : Starter for using the Quartz scheduler</li>
<li><code>spring-boot-starter-security</code> : Starter for using Spring Security</li>
<li><code>spring-boot-starter-test</code> : Starter for testing Spring Boot applications
with libraries including JUnit, Hamcrest and Mockito</li>
<li><code>spring-boot-starter-thymeleaf</code> : Starter for building MVC web applications
using Thymeleaf views</li>
<li><code>spring-boot-starter-validation</code> : Starter for using Java Bean Validation
with Hibernate Validator</li>
<li><code>spring-boot-starter-web</code> : Starter for building web, including RESTful,
applications using Spring MVC. Uses Tomcat as the default embedded
container</li>
<li><code>spring-boot-starter-web-services</code> : Starter for using Spring Web Services</li>
<li><code>spring-boot-starter-webflux</code> : Starter for building WebFlux applications
using Spring Framework's Reactive Web support</li>
<li><code>spring-boot-starter-websocket</code> : Starter for building WebSocket
applications using Spring Framework's WebSocket support</li>
</ul>
</div>
</div>
</div>
