lang/java-lib-springboot.org
* Spring Beans 和依赖注入
  Spring Framework 的相关技术在 SpringBoot 工程中都是支持的，常见的标注如下：
  - ~@ComponentScan~ : 查找 Beans
  - ~@Autowired~ : 注入的构造器
  - ~@Component~ : 组件
  - ~@Repository~ : 仓库
  - ~@Service~ : 服务
  - ~@Controller~ : 控制器

  下面是依赖注入的示例
  #+BEGIN_SRC java
    package com.example.service;
    import org.springframework.beans.factory.annotation.Autowired;
    import org.springframework.stereotype.Service;

    @Service
    public class DatabaseAccountService implements AccountService {
      private final RiskAssessor riskAssessor;

      @Autowired
      public DatabaseAccountService(RiskAssessor riskAssessor) {
        this.riskAssessor = riskAssessor;
      }

      // ...
    }
  #+END_SRC

  #+BEGIN_SRC java
    @Service
    public class DatabaseAccountService implements AccountService {
      private final RiskAssessor riskAssessor;

      public DatabaseAccountService(RiskAssessor riskAssessor) {
        this.riskAssessor = riskAssessor;
      }

      // ...
    }
  #+END_SRC

* =@SpringBootApplication= 标注
  Spring Framework 提供了下面的基本标注
  - =@EnableAutoConfiguration= : 开启自动配置
  - =@ComponentScan= : 开启自动扫描组件
  - =@Configuration= : 允许在上下文中注册其它的 Bean 或导入其它的配置类

  =@SpringBootApplication= 相当于同时开启了上面三项配置
  #+BEGIN_SRC java
    package com.example.myapplication;
    import org.springframework.boot.SpringApplication;
    import org.springframework.boot.autoconfigure.SpringBootApplication;


    @SpringBootApplication // same as @Configuration @EnableAutoConfiguration @ComponentScan
    public class Application {

      public static void main(String[] args) {
        SpringApplication.run(Application.class, args);
      }

    }
  #+END_SRC

* 外部配置
  SpringBoot 允许使用外部配置方便应用在不同的环境下运行。
**  ~@Value~ 方式配置
   #+BEGIN_SRC java
     @Component
     public class MyBean {

       @Value("${name}")
       private String name;

       // ...
     }
   #+END_SRC

