lang/java-lib-springboot.html

<div id="outline-container-orgde39c02" class="outline-2">
<h2 id="orgde39c02"><span class="section-number-2">4</span> Spring Beans 和依赖注入</h2>
<div class="outline-text-2" id="text-4">
<p>
Spring Framework 的相关技术在 SpringBoot 工程中都是支持的，常见的标注如下：
</p>
<ul class="org-ul">
<li><code>@ComponentScan</code> : 查找 Beans</li>
<li><code>@Autowired</code> : 注入的构造器</li>
<li><code>@Component</code> : 组件</li>
<li><code>@Repository</code> : 仓库</li>
<li><code>@Service</code> : 服务</li>
<li><code>@Controller</code> : 控制器</li>
</ul>

<p>
下面是依赖注入的示例
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900;">package</span> com.example.<span style="color: #268bd2;">service</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">beans</span>.<span style="color: #268bd2;">factory</span>.<span style="color: #268bd2;">annotation</span>.<span style="color: #268bd2;">Autowired</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">stereotype</span>.<span style="color: #268bd2;">Service</span>;

<span style="color: #268bd2;">@Service</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">DatabaseAccountService</span> <span style="color: #859900;">implements</span> <span style="color: #268bd2;">AccountService</span> <span style="color: #8d5649;">{</span>
  <span style="color: #859900;">private</span> <span style="color: #859900;">final</span> <span style="color: #268bd2;">RiskAssessor</span> <span style="color: #6c71c4;">riskAssessor</span>;

  <span style="color: #268bd2;">@Autowired</span>
  <span style="color: #859900;">public</span> <span style="color: #b58900;">DatabaseAccountService</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">RiskAssessor</span> <span style="color: #6c71c4;">riskAssessor</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #859900;">this</span>.riskAssessor = riskAssessor;
  <span style="color: #d8241f;">}</span>

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">...</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2;">@Service</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">DatabaseAccountService</span> <span style="color: #859900;">implements</span> <span style="color: #268bd2;">AccountService</span> <span style="color: #8d5649;">{</span>
  <span style="color: #859900;">private</span> <span style="color: #859900;">final</span> <span style="color: #268bd2;">RiskAssessor</span> <span style="color: #6c71c4;">riskAssessor</span>;

  <span style="color: #859900;">public</span> <span style="color: #b58900;">DatabaseAccountService</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">RiskAssessor</span> <span style="color: #6c71c4;">riskAssessor</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #859900;">this</span>.riskAssessor = riskAssessor;
  <span style="color: #d8241f;">}</span>

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">...</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga41967e" class="outline-2">
<h2 id="orga41967e"><span class="section-number-2">5</span> <code>@SpringBootApplication</code> 标注</h2>
<div class="outline-text-2" id="text-5">
<p>
Spring Framework 提供了下面的基本标注
</p>
<ul class="org-ul">
<li><code>@EnableAutoConfiguration</code> : 开启自动配置</li>
<li><code>@ComponentScan</code> : 开启自动扫描组件</li>
<li><code>@Configuration</code> : 允许在上下文中注册其它的 Bean 或导入其它的配置类</li>
</ul>

<p>
<code>@SpringBootApplication</code> 相当于同时开启了上面三项配置
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900;">package</span> com.example.<span style="color: #268bd2;">myapplication</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">boot</span>.<span style="color: #268bd2;">SpringApplication</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">boot</span>.<span style="color: #268bd2;">autoconfigure</span>.<span style="color: #268bd2;">SpringBootApplication</span>;


<span style="color: #268bd2;">@SpringBootApplication</span> <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">same as @Configuration @EnableAutoConfiguration @ComponentScan</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">Application</span> <span style="color: #8d5649;">{</span>

  <span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">main</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">String</span><span style="color: #9564bf;">[]</span> <span style="color: #6c71c4;">args</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    SpringApplication.run<span style="color: #9564bf;">(</span>Application.<span style="color: #859900;">class</span>, args<span style="color: #9564bf;">)</span>;
  <span style="color: #d8241f;">}</span>

<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac831a0" class="outline-2">
<h2 id="orgac831a0"><span class="section-number-2">6</span> 外部配置</h2>
<div class="outline-text-2" id="text-6">
<p>
SpringBoot 允许使用外部配置方便应用在不同的环境下运行。
</p>
</div>
<div id="outline-container-org73376e3" class="outline-3">
<h3 id="org73376e3"><span class="section-number-3">6.1</span> <code>@Value</code> 方式配置</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2;">@Component</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">MyBean</span> <span style="color: #8d5649;">{</span>

  <span style="color: #268bd2;">@Value</span><span style="color: #d8241f;">(</span><span style="color: #2aa198;">"${name}"</span><span style="color: #d8241f;">)</span>
  <span style="color: #859900;">private</span> <span style="color: #268bd2;">String</span> <span style="color: #6c71c4;">name</span>;

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">...</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
