lang/java-lib-springboot.org
** ~@ConfigurationProperties~ 方式配置
   该种配置方法比 ~@Value~ 更加安全

   先定义配置项的 Java Bean
   #+BEGIN_SRC java
     package com.example;

     import java.net.InetAddress;
     import java.util.ArrayList;
     import java.util.Collections;
     import java.util.List;

     import org.springframework.boot.context.properties.ConfigurationProperties;

     @ConfigurationProperties("acme")
     public class AcmeProperties {

         private boolean enabled;
         private InetAddress remoteAddress;
         private final Security security = new Security();

         public boolean isEnabled() { ... }
         public void setEnabled(boolean enabled) { ... }

         public InetAddress getRemoteAddress() { ... }
         public void setRemoteAddress(InetAddress remoteAddress) { ... }

         public Security getSecurity() { ... }

         public static class Security {

          private String username;
          private String password;
         private List<String> roles = new ArrayList<>(Collections.singleton("USER"));

         public String getUsername() { ... }
         public void setUsername(String username) { ... }

         public String getPassword() { ... }
         public void setPassword(String password) { ... }

         public List<String> getRoles() { ... }
         public void setRoles(List<String> roles) { ... }
         }
     }
   #+END_SRC

   上述的配置类对应于配置文件中的这些配置项
   - =acme.enabled= 定义一个值，默认为空
   - =acme.remote-address= 能通过字符串强制转换的类型
   - =acme.security.username= 自带 Security 对象，用户名
   - =acme.security.password=
   - =acme.security.roles= 字符串集合

   添加配置项，通过 =@EnableConfigurationProperties= 标注来扫描配置的 Java Bean
   #+BEGIN_SRC java
     @Configuration
     @EnableConfigurationProperties(AcmeProperties.class)
     public class MyConfiguration {
       // ...
     }
   #+END_SRC

   并且需要添加 =@Configuration= 到 Java Bean 中
   #+BEGIN_SRC java
     @Component
     @ConfigurationProperties(prefix="acme")
     public class AcmeProperties {
       // ... see the preceding example
     }
   #+END_SRC

   最后就可以将定义的 Java Bean 配置项注入到其它组件中
   #+BEGIN_SRC java
     @Service
     public class MyService {

       private final AcmeProperties properties;

       @Autowired
       public MyService(AcmeProperties properties) {
         this.properties = properties;
       }

       //...

       @PostConstruct
       public void openConnection() {
         Server server = new Server(this.properties.getRemoteAddress());
         // ...
       }

     }
   #+END_SRC

* 日志
  SpringBoot 提供了一个统一的日志配置，可以兼容 Java Util Logging、Log4J2 和
  Logback 等日志系统作为后端。

