lang/java-lib-springboot.html

<div id="outline-container-orga42032f" class="outline-3">
<h3 id="orga42032f"><span class="section-number-3">6.2</span> <code>@ConfigurationProperties</code> 方式配置</h3>
<div class="outline-text-3" id="text-6-2">
<p>
该种配置方法比 <code>@Value</code> 更加安全
</p>

<p>
先定义配置项的 Java Bean
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900;">package</span> com.<span style="color: #268bd2;">example</span>;

<span style="color: #859900;">import</span> <span style="color: #268bd2;">java</span>.<span style="color: #268bd2;">net</span>.<span style="color: #268bd2;">InetAddress</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">java</span>.<span style="color: #268bd2;">util</span>.<span style="color: #268bd2;">ArrayList</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">java</span>.<span style="color: #268bd2;">util</span>.<span style="color: #268bd2;">Collections</span>;
<span style="color: #859900;">import</span> <span style="color: #268bd2;">java</span>.<span style="color: #268bd2;">util</span>.<span style="color: #268bd2;">List</span>;

<span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">boot</span>.<span style="color: #268bd2;">context</span>.<span style="color: #268bd2;">properties</span>.<span style="color: #268bd2;">ConfigurationProperties</span>;

<span style="color: #268bd2;">@ConfigurationProperties</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">"acme"</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">AcmeProperties</span> <span style="color: #8d5649;">{</span>

    <span style="color: #859900;">private</span> <span style="color: #268bd2;">boolean</span> <span style="color: #6c71c4;">enabled</span>;
    <span style="color: #859900;">private</span> <span style="color: #268bd2;">InetAddress</span> <span style="color: #6c71c4;">remoteAddress</span>;
    <span style="color: #859900;">private</span> <span style="color: #859900;">final</span> <span style="color: #268bd2;">Security</span> <span style="color: #6c71c4;">security</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">Security</span><span style="color: #d8241f;">()</span>;

    <span style="color: #859900;">public</span> <span style="color: #268bd2;">boolean</span> <span style="color: #b58900;">isEnabled</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span> ... <span style="color: #d8241f;">}</span>
    <span style="color: #859900;">public</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">setEnabled</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">boolean</span> <span style="color: #6c71c4;">enabled</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span> ... <span style="color: #d8241f;">}</span>

    <span style="color: #859900;">public</span> <span style="color: #268bd2;">InetAddress</span> <span style="color: #b58900;">getRemoteAddress</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span> ... <span style="color: #d8241f;">}</span>
    <span style="color: #859900;">public</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">setRemoteAddress</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">InetAddress</span> <span style="color: #6c71c4;">remoteAddress</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span> ... <span style="color: #d8241f;">}</span>

    <span style="color: #859900;">public</span> <span style="color: #268bd2;">Security</span> <span style="color: #b58900;">getSecurity</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span> ... <span style="color: #d8241f;">}</span>

    <span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">Security</span> <span style="color: #d8241f;">{</span>

     <span style="color: #859900;">private</span> <span style="color: #268bd2;">String</span> <span style="color: #6c71c4;">username</span>;
     <span style="color: #859900;">private</span> <span style="color: #268bd2;">String</span> <span style="color: #6c71c4;">password</span>;
    <span style="color: #859900;">private</span> <span style="color: #268bd2;">List</span><span style="color: #9564bf;">&lt;</span><span style="color: #268bd2;">String</span><span style="color: #9564bf;">&gt;</span> <span style="color: #6c71c4;">roles</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">ArrayList</span><span style="color: #9564bf;">&lt;&gt;(</span>Collections.singleton<span style="color: #24a222;">(</span><span style="color: #2aa198;">"USER"</span><span style="color: #24a222;">)</span><span style="color: #9564bf;">)</span>;

    <span style="color: #859900;">public</span> <span style="color: #268bd2;">String</span> <span style="color: #b58900;">getUsername</span><span style="color: #9564bf;">()</span> <span style="color: #9564bf;">{</span> ... <span style="color: #9564bf;">}</span>
    <span style="color: #859900;">public</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">setUsername</span><span style="color: #9564bf;">(</span><span style="color: #268bd2;">String</span> <span style="color: #6c71c4;">username</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span> ... <span style="color: #9564bf;">}</span>

    <span style="color: #859900;">public</span> <span style="color: #268bd2;">String</span> <span style="color: #b58900;">getPassword</span><span style="color: #9564bf;">()</span> <span style="color: #9564bf;">{</span> ... <span style="color: #9564bf;">}</span>
    <span style="color: #859900;">public</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">setPassword</span><span style="color: #9564bf;">(</span><span style="color: #268bd2;">String</span> <span style="color: #6c71c4;">password</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span> ... <span style="color: #9564bf;">}</span>

    <span style="color: #859900;">public</span> <span style="color: #268bd2;">List</span><span style="color: #9564bf;">&lt;</span><span style="color: #268bd2;">String</span><span style="color: #9564bf;">&gt;</span> <span style="color: #b58900;">getRoles</span><span style="color: #9564bf;">()</span> <span style="color: #9564bf;">{</span> ... <span style="color: #9564bf;">}</span>
    <span style="color: #859900;">public</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">setRoles</span><span style="color: #9564bf;">(</span><span style="color: #268bd2;">List</span><span style="color: #24a222;">&lt;</span><span style="color: #268bd2;">String</span><span style="color: #24a222;">&gt;</span> <span style="color: #6c71c4;">roles</span><span style="color: #9564bf;">)</span> <span style="color: #9564bf;">{</span> ... <span style="color: #9564bf;">}</span>
    <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
上述的配置类对应于配置文件中的这些配置项
</p>
<ul class="org-ul">
<li><code>acme.enabled</code> 定义一个值，默认为空</li>
<li><code>acme.remote-address</code> 能通过字符串强制转换的类型</li>
<li><code>acme.security.username</code> 自带 Security 对象，用户名</li>
<li><code>acme.security.password</code></li>
<li><code>acme.security.roles</code> 字符串集合</li>
</ul>

<p>
添加配置项，通过 <code>@EnableConfigurationProperties</code> 标注来扫描配置的 Java Bean
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2;">@Configuration</span>
<span style="color: #268bd2;">@EnableConfigurationProperties</span><span style="color: #8d5649;">(</span>AcmeProperties.<span style="color: #859900;">class</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">MyConfiguration</span> <span style="color: #8d5649;">{</span>
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">...</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
并且需要添加 <code>@Configuration</code> 到 Java Bean 中
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2;">@Component</span>
<span style="color: #268bd2;">@ConfigurationProperties</span><span style="color: #8d5649;">(</span>prefix=<span style="color: #2aa198;">"acme"</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">AcmeProperties</span> <span style="color: #8d5649;">{</span>
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">... see the preceding example</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
最后就可以将定义的 Java Bean 配置项注入到其它组件中
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2;">@Service</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">MyService</span> <span style="color: #8d5649;">{</span>

  <span style="color: #859900;">private</span> <span style="color: #859900;">final</span> <span style="color: #268bd2;">AcmeProperties</span> <span style="color: #6c71c4;">properties</span>;

  <span style="color: #268bd2;">@Autowired</span>
  <span style="color: #859900;">public</span> <span style="color: #b58900;">MyService</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">AcmeProperties</span> <span style="color: #6c71c4;">properties</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>
    <span style="color: #859900;">this</span>.properties = properties;
  <span style="color: #d8241f;">}</span>

  <span style="color: #93a1a1; font-style: italic;">//</span><span style="color: #93a1a1; font-style: italic;">...</span>

  <span style="color: #268bd2;">@PostConstruct</span>
  <span style="color: #859900;">public</span> <span style="color: #268bd2;">void</span> <span style="color: #b58900;">openConnection</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{</span>
    <span style="color: #268bd2;">Server</span> <span style="color: #6c71c4;">server</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">Server</span><span style="color: #9564bf;">(</span><span style="color: #859900;">this</span>.properties.getRemoteAddress<span style="color: #24a222;">()</span><span style="color: #9564bf;">)</span>;
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">...</span>
  <span style="color: #d8241f;">}</span>

<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge97b3b0" class="outline-2">
<h2 id="orge97b3b0"><span class="section-number-2">7</span> 日志</h2>
<div class="outline-text-2" id="text-7">
<p>
SpringBoot 提供了一个统一的日志配置，可以兼容 Java Util Logging、Log4J2 和
Logback 等日志系统作为后端。
</p>
</div>
