lang/java-lib-springboot.html

<div id="outline-container-orge107388" class="outline-3">
<h3 id="orge107388"><span class="section-number-3">7.1</span> 日志样式</h3>
<div class="outline-text-3" id="text-7-1">
<p>
默认的输出样式如下：
</p>
<div class="org-src-container">
<pre class="src src-text">2014-03-05 10:57:51.112  INFO 45469 --- [           main] org.apache.catalina.core.StandardEngine  : Starting Servlet Engine: Apache Tomcat/7.0.52
2014-03-05 10:57:51.253  INFO 45469 --- [ost-startStop-1] o.a.c.c.C.[Tomcat].[localhost].[/]       : Initializing Spring embedded WebApplicationContext
2014-03-05 10:57:51.253  INFO 45469 --- [ost-startStop-1] o.s.web.context.ContextLoader            : Root WebApplicationContext: initialization completed in 1358 ms
2014-03-05 10:57:51.698  INFO 45469 --- [ost-startStop-1] o.s.b.c.e.ServletRegistrationBean        : Mapping servlet: 'dispatcherServlet' to [/]
2014-03-05 10:57:51.702  INFO 45469 --- [ost-startStop-1] o.s.b.c.embedded.FilterRegistrationBean  : Mapping filter: 'hiddenHttpMethodFilter' to: [/*]
</pre>
</div>
<p>
包括以下几个部分：
</p>
<ul class="org-ul">
<li>Date and Time: Millisecond precision and easily sortable.</li>
<li>Log Level: ERROR, WARN, INFO, DEBUG, or TRACE.</li>
<li>Process ID.</li>
<li>A &#x2014; separator to distinguish the start of actual log messages.</li>
<li>Thread name: Enclosed in square brackets (may be truncated for console output).</li>
<li>Logger name: This is usually the source class name (often abbreviated).</li>
<li>The log message</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb5fb04" class="outline-3">
<h3 id="orgdb5fb04"><span class="section-number-3">7.2</span> 控制台输出</h3>
<div class="outline-text-3" id="text-7-2">
<p>
控制台输出默认记录 ERROR, WARN 和 INFO 基本的日志，可以使用 <code>--debug</code> 开启调
试级别的输出。
</p>
<div class="org-src-container">
<pre class="src src-sh">java -jar myapp.jar --debug
</pre>
</div>

<p>
也可以在配置文件 <code>application.yml</code> 中设置 <code>debug=true</code>
</p>

<p>
如果控制台支持彩色输出，那么还可以配置彩色输出日志
</p>
<ul class="org-ul">
<li>开启配置文件中的 <code>spring.output.ansi.enabled</code> 选项</li>
<li>使用 <code>%clr(%5p)</code> 可以根据日志基本来变换颜色。各级别对应的颜色： 红色
(FATAL, ERROR)，黄色（INFO），绿色（INFO, DEBUG）</li>
<li>设置日期的颜色 <code>%clr(%d{yyyy-MM-dd HH:mm:ss.SSS}){yellow}</code> ，默认支持以下几
种色彩： blue cyan faint green magenta red yellow</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2e551d" class="outline-3">
<h3 id="orgf2e551d"><span class="section-number-3">7.3</span> 文件输出</h3>
<div class="outline-text-3" id="text-7-3">
<p>
文件输出通过 <code>logging.file</code> 和 <code>logging.path</code> 来控制
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">logging.file</th>
<th scope="col" class="org-left">logging.path</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">(none)</td>
<td class="org-left">(none)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">仅开启控制台输出</td>
</tr>

<tr>
<td class="org-left">Specific file</td>
<td class="org-left">(none)</td>
<td class="org-left">my.log</td>
<td class="org-left">输出到文件，文件路径是当前文件夹的相对路径</td>
</tr>

<tr>
<td class="org-left">(none)</td>
<td class="org-left">Specific directory</td>
<td class="org-left">/var/log</td>
<td class="org-left">输出到文件，文件路径可以是相对路径或绝对路径</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><code>logging.file.max-size</code> 设置文件的最大存储大小</li>
<li><code>logging.file.max-history</code> 设置最大的历史文件数量</li>
</ul>
</div>
</div>

<div id="outline-container-org262b128" class="outline-3">
<h3 id="org262b128"><span class="section-number-3">7.4</span> 日志级别</h3>
<div class="outline-text-3" id="text-7-4">
<p>
日志级别可以通过 <code>logging.level.&lt;logger-name&gt;=&lt;level&gt;</code> 来设置，其中
<code>logging.level.root</code> 是设置默认级别
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #6c71c4;">logging.level.root</span>=WARN
<span style="color: #6c71c4;">logging.level.org.springframework.web</span>=DEBUG
<span style="color: #6c71c4;">logging.level.org.hibernate</span>=ERROR
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebb75c9" class="outline-3">
<h3 id="orgebb75c9"><span class="section-number-3">7.5</span> 日志分组</h3>
<div class="outline-text-3" id="text-7-5">
<p>
日志基本可以通过分组来设置，例如
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #6c71c4;">logging.group.tomcat</span>=org.apache.catalina, org.apache.coyote, org.apache.tomcat
</pre>
</div>

<p>
SpringBoot 的默认分组有下面几个：
</p>
<ul class="org-ul">
<li>web : <code>org.springframework.core.codec, org.springframework.http, org.springframework.web</code></li>
<li>sql : <code>org.springframework.jdbc.core, org.hibernate.SQL</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbdf15c9" class="outline-2">
<h2 id="orgbdf15c9"><span class="section-number-2">8</span> 配置数据库</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org67c256e" class="outline-3">
<h3 id="org67c256e"><span class="section-number-3">8.1</span> MySQL</h3>
<div class="outline-text-3" id="text-8-1">
<p>
<code>application.yml</code> 配置文件中添加用户名、密码等相关信息
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #6c71c4;">spring</span>:
  <span style="color: #6c71c4;">jpa</span>:
    <span style="color: #6c71c4;">database-platform</span>: org.hibernate.dialect.MySQL5Dialect
  <span style="color: #6c71c4;">datasource</span>:
    <span style="color: #6c71c4;">platform</span>: mysql
    <span style="color: #6c71c4;">username</span>: username
    <span style="color: #6c71c4;">password</span>: password
    <span style="color: #6c71c4;">url</span>: jdbc:mysql://localhost:3306/database?useUnicode=true<span style="color: #b58900;">&amp;characterEncoding</span>=utf-8<span style="color: #b58900;">&amp;useSSL</span>=false
    <span style="color: #6c71c4;">driver-class-name</span>: com.mysql.jdbc.Driver
</pre>
</div>

<p>
<code>pom.xml</code> 文件中添加 MySQL 依赖
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #b58900;">dependency</span>&gt;
  &lt;<span style="color: #b58900;">groupId</span>&gt;mysql&lt;/<span style="color: #b58900;">groupId</span>&gt;
  &lt;<span style="color: #b58900;">artifactId</span>&gt;mysql-connector-java&lt;/<span style="color: #b58900;">artifactId</span>&gt;
  &lt;<span style="color: #b58900;">version</span>&gt;5.1.38&lt;/<span style="color: #b58900;">version</span>&gt;
&lt;/<span style="color: #b58900;">dependency</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4923f28" class="outline-3">
<h3 id="org4923f28"><span class="section-number-3">8.2</span> PostgreSQL</h3>
<div class="outline-text-3" id="text-8-2">
<p>
<code>application.yml</code> 配置文件中添加用户名、密码等相关信息
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #6c71c4;">spring</span>:
  <span style="color: #6c71c4;">jpa</span>:
    <span style="color: #6c71c4;">database-platform</span>: org.hibernate.dialect.PostgreSQL9Dialect
  <span style="color: #6c71c4;">datasource</span>:
    <span style="color: #6c71c4;">platform</span>: postgres
    <span style="color: #6c71c4;">username</span>: username
    <span style="color: #6c71c4;">password</span>: password
    <span style="color: #6c71c4;">url</span>: jdbc:postgresql://localhost:5432/database
    <span style="color: #6c71c4;">driver-class-name</span>: org.postgresql.Driver
</pre>
</div>

<p>
<code>pom.xml</code> 文件中添加 PostgreSQL 依赖
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #b58900;">dependency</span>&gt;
  &lt;<span style="color: #b58900;">groupId</span>&gt;org.postgresql&lt;/<span style="color: #b58900;">groupId</span>&gt;
  &lt;<span style="color: #b58900;">artifactId</span>&gt;postgresql&lt;/<span style="color: #b58900;">artifactId</span>&gt;
  &lt;<span style="color: #b58900;">version</span>&gt;42.2.5&lt;/<span style="color: #b58900;">version</span>&gt;
&lt;/<span style="color: #b58900;">dependency</span>&gt;
</pre>
</div>
</div>
</div>
