lang/java-lib-springboot.org
** Oracle
   =application.yml= 配置文件中添加用户名、密码等相关信息
   #+BEGIN_SRC yaml
     spring:
       ### oracle 10g ###
       jpa:
         database-platform: org.hibernate.dialect.Oracle10gDialect
       datasource:
         username: username
         password: password
         url: jdbc:oracle:thin:@//localhost:1521/database
         driver-class-name: oracle.jdbc.OracleDriver
   #+END_SRC

   =pom.xml= 文件中添加 PostgreSQL 依赖
   #+BEGIN_SRC xml
     <dependency>
       <groupId>com.oracle</groupId>
       <artifactId>ojdbc6</artifactId>
       <version>11.2.0.4.0</version>
       <scope>provided</scope>
     </dependency>
   #+END_SRC

   Oracle 的驱动是收费的，需要手工安装，默认在 =$ORACLE_HOME/jdbc/lib/= 文件夹中，
   文档中对 ojdbc 描述如下：
   #+BEGIN_SRC text
     Driver Versions
     ---------------

     These are the driver versions in the 10.2.0.1.0 release:

       - JDBC Thin Driver 10.2.0.1.0
         100% Java client-side JDBC driver for use in client applications,
         middle-tier servers and applets.

       - JDBC OCI Driver 10.2.0.1.0
         Client-side JDBC driver for use on a machine where OCI 10.2.0.1.0
         is installed.

       - JDBC Thin Server-side Driver 10.2.0.1.0
         JDBC driver for use in Java program in the database to access
         remote Oracle databases.

       - JDBC Server-side Internal Driver 10.2.0.1.0
         Server-side JDBC driver for use by Java Stored procedures.  This
         driver used to be called the "JDBC Kprb Driver".

     For complete documentation, please refer to "JDBC Developer's Guide
     and Reference".


     Contents Of This Release
     ------------------------

     For all platforms:

       [ORACLE_HOME]/jdbc/lib contains:

       - classes12.jar
         Classes for use with JDK 1.2 and JDK 1.3.  It contains the
         JDBC driver classes, except classes for NLS support in Oracle
         Object and Collection types.

       - classes12_g.jar
         Same as classes12.jar, except that classes were compiled with
         "javac -g" and contain some tracing information.

       - classes12dms.jar
         Same as classes12.jar, except that it contains additional code
         to support Oracle Dynamic Monitoring Service. Can only be used
         when dms.jar is in the classpath. dms.jar is provided as part of
         recent Oracle Application Server releases.

       - classes12dms_g.jar
         Same as classes12dms.jar except that classes were compiled with
         "javac -g" and contain some tracing information.

       - ojdbc14.jar
         Classes for use with JDK 1.4 and 5.0.  It contains the JDBC driver
         classes, except classes for NLS support in Oracle Object and
         Collection types.

       - ojdbc14_g.jar
         Same as ojdbc14.jar, except that classes were compiled with
         "javac -g" and contain some tracing information.

       - ojdbc14dms.jar
         Same as ojdbc14.jar, except that it contains additional code
         to support Oracle Dynamic Monitoring Service. Can only be used
         when dms.jar is in the classpath. dms.jar is provided as part of
         recent Oracle Application Server releases.

       - ojdbc14dms_g.jar
         Same as ojdbc14dms.jar except that classes were compiled with
         "javac -g" and contain some tracing information.

       [ORACLE_HOME]/jdbc/doc/javadoc.tar contains the JDBC Javadoc
       for the public API of the public classes of Oracle JDBC.

       [ORACLE_HOME]/jdbc/demo/demo.tar contains sample JDBC programs.

       [ORACLE_HOME]/jlib/orai18n.jar
         NLS classes for use with JDK 1.2, 1.3, 1.4, and 5.0.  It contains
         classes for NLS support in Oracle Object and Collection types.
         This jar file replaces the old nls_charset jar/zip files. In
         Oracle 10g R1 it was duplicated in [ORACLE_HOME]/jdbc/lib. We
         have removed the duplicate copy and you should now get it from
         its proper location.

   #+END_SRC
   安装适配你项目的 jar 文件即可
   #+BEGIN_SRC sh
     mvn install:install-file -Dpackaging=jar \
       -DgroupId=com.oracle -DartifactId=ojdbc6 -Dversion=11.2.0.4.0 \
       -Dfile=<path-to-jar>
   #+END_SRC

* 开发工具
  SpringBoot 的提供了开发工具套件，可以实现自动加载，仅仅需要在 =pom.xml= 文件中
  加入下面依赖即可自动添加
  #+BEGIN_SRC xml
    <dependencies>
     <dependency>
      <groupId>org.springframework.boot</groupId>
      <artifactId>spring-boot-devtools</artifactId>
      <optional>true</optional>
     </dependency>
    </dependencies>
  #+END_SRC
