lang/java-lib-springboot.html

<div id="outline-container-org509a6a8" class="outline-3">
<h3 id="org509a6a8"><span class="section-number-3">8.3</span> Oracle</h3>
<div class="outline-text-3" id="text-8-3">
<p>
<code>application.yml</code> 配置文件中添加用户名、密码等相关信息
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #6c71c4;">spring</span>:
  <span style="color: #93a1a1; font-style: italic;">### </span><span style="color: #93a1a1; font-style: italic;">oracle 10g ###</span>
  <span style="color: #6c71c4;">jpa</span>:
    <span style="color: #6c71c4;">database-platform</span>: org.hibernate.dialect.Oracle10gDialect
  <span style="color: #6c71c4;">datasource</span>:
    <span style="color: #6c71c4;">username</span>: username
    <span style="color: #6c71c4;">password</span>: password
    <span style="color: #6c71c4;">url</span>: jdbc:oracle:thin:@//localhost:1521/database
    <span style="color: #6c71c4;">driver-class-name</span>: oracle.jdbc.OracleDriver
</pre>
</div>

<p>
<code>pom.xml</code> 文件中添加 PostgreSQL 依赖
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #b58900;">dependency</span>&gt;
  &lt;<span style="color: #b58900;">groupId</span>&gt;com.oracle&lt;/<span style="color: #b58900;">groupId</span>&gt;
  &lt;<span style="color: #b58900;">artifactId</span>&gt;ojdbc6&lt;/<span style="color: #b58900;">artifactId</span>&gt;
  &lt;<span style="color: #b58900;">version</span>&gt;11.2.0.4.0&lt;/<span style="color: #b58900;">version</span>&gt;
  &lt;<span style="color: #b58900;">scope</span>&gt;provided&lt;/<span style="color: #b58900;">scope</span>&gt;
&lt;/<span style="color: #b58900;">dependency</span>&gt;
</pre>
</div>

<p>
Oracle 的驱动是收费的，需要手工安装，默认在 <code>$ORACLE_HOME/jdbc/lib/</code> 文件夹中，
文档中对 ojdbc 描述如下：
</p>
<div class="org-src-container">
<pre class="src src-text">Driver Versions
---------------

These are the driver versions in the 10.2.0.1.0 release:

  - JDBC Thin Driver 10.2.0.1.0
    100% Java client-side JDBC driver for use in client applications,
    middle-tier servers and applets.

  - JDBC OCI Driver 10.2.0.1.0
    Client-side JDBC driver for use on a machine where OCI 10.2.0.1.0
    is installed.

  - JDBC Thin Server-side Driver 10.2.0.1.0
    JDBC driver for use in Java program in the database to access
    remote Oracle databases.

  - JDBC Server-side Internal Driver 10.2.0.1.0
    Server-side JDBC driver for use by Java Stored procedures.  This
    driver used to be called the "JDBC Kprb Driver".

For complete documentation, please refer to "JDBC Developer's Guide
and Reference".


Contents Of This Release
------------------------

For all platforms:

  [ORACLE_HOME]/jdbc/lib contains:

  - classes12.jar
    Classes for use with JDK 1.2 and JDK 1.3.  It contains the
    JDBC driver classes, except classes for NLS support in Oracle
    Object and Collection types.

  - classes12_g.jar
    Same as classes12.jar, except that classes were compiled with
    "javac -g" and contain some tracing information.

  - classes12dms.jar
    Same as classes12.jar, except that it contains additional code
    to support Oracle Dynamic Monitoring Service. Can only be used
    when dms.jar is in the classpath. dms.jar is provided as part of
    recent Oracle Application Server releases.

  - classes12dms_g.jar
    Same as classes12dms.jar except that classes were compiled with
    "javac -g" and contain some tracing information.

  - ojdbc14.jar
    Classes for use with JDK 1.4 and 5.0.  It contains the JDBC driver
    classes, except classes for NLS support in Oracle Object and
    Collection types.

  - ojdbc14_g.jar
    Same as ojdbc14.jar, except that classes were compiled with
    "javac -g" and contain some tracing information.

  - ojdbc14dms.jar
    Same as ojdbc14.jar, except that it contains additional code
    to support Oracle Dynamic Monitoring Service. Can only be used
    when dms.jar is in the classpath. dms.jar is provided as part of
    recent Oracle Application Server releases.

  - ojdbc14dms_g.jar
    Same as ojdbc14dms.jar except that classes were compiled with
    "javac -g" and contain some tracing information.

  [ORACLE_HOME]/jdbc/doc/javadoc.tar contains the JDBC Javadoc
  for the public API of the public classes of Oracle JDBC.

  [ORACLE_HOME]/jdbc/demo/demo.tar contains sample JDBC programs.

  [ORACLE_HOME]/jlib/orai18n.jar
    NLS classes for use with JDK 1.2, 1.3, 1.4, and 5.0.  It contains
    classes for NLS support in Oracle Object and Collection types.
    This jar file replaces the old nls_charset jar/zip files. In
    Oracle 10g R1 it was duplicated in [ORACLE_HOME]/jdbc/lib. We
    have removed the duplicate copy and you should now get it from
    its proper location.

</pre>
</div>
<p>
安装适配你项目的 jar 文件即可
</p>
<div class="org-src-container">
<pre class="src src-sh">mvn install:install-file -Dpackaging=jar <span style="color: #2aa198;">\</span>
  -DgroupId=com.oracle -DartifactId=ojdbc6 -Dversion=11.2.0.4.0 <span style="color: #2aa198;">\</span>
  -Dfile=&lt;path-to-jar&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5d87259" class="outline-2">
<h2 id="org5d87259"><span class="section-number-2">9</span> 开发工具</h2>
<div class="outline-text-2" id="text-9">
<p>
SpringBoot 的提供了开发工具套件，可以实现自动加载，仅仅需要在 <code>pom.xml</code> 文件中
加入下面依赖即可自动添加
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #b58900;">dependencies</span>&gt;
 &lt;<span style="color: #b58900;">dependency</span>&gt;
  &lt;<span style="color: #b58900;">groupId</span>&gt;org.springframework.boot&lt;/<span style="color: #b58900;">groupId</span>&gt;
  &lt;<span style="color: #b58900;">artifactId</span>&gt;spring-boot-devtools&lt;/<span style="color: #b58900;">artifactId</span>&gt;
  &lt;<span style="color: #b58900;">optional</span>&gt;true&lt;/<span style="color: #b58900;">optional</span>&gt;
 &lt;/<span style="color: #b58900;">dependency</span>&gt;
&lt;/<span style="color: #b58900;">dependencies</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-07-10 Wed 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-07-10 Wed 11:03</p>
<p class="validation"></p>
</div>
</body>
</html>
